app/Controllers/AdminController.php

    public function dashboard()
    {
        //the new dashboard calculations for the bar chart with the Date for 'LastMonth' and the 'Weekly Stats' method in the TicketModel

        $model = new \App\Models\TicketModel();
        $db = \Config\Database::connect();

        // 1. Calculate Date Ranges
        $startLastMonth = date('Y-m-01 00:00:00', strtotime('first day of last month'));
        $endLastMonth   = date('Y-m-t 23:59:59', strtotime('last day of last month'));

        // Weekly Friday Logic: Compiles the last 7 days leading up to today
        $startOfWeek = date('Y-m-d H:i:s', strtotime('last friday', strtotime('tomorrow')));
        $endOfWeek   = date('Y-m-d H:i:s');

        // 2. Fetch Data
        $data['stats'] = $model->getWeeklyStats();
        $data['trends'] = $db->table('monthly_archives')->orderBy('id', 'DESC')->limit(6)->get()->getResult();
---
SELECT *
FROM `monthly_archives`
ORDER BY `id` DESC
 LIMIT 6

    public function manageUsers()
    {
        $userModel = new UserModel();
        // Fetch all users with their emails
        $data['users'] = $userModel->select('users.*, auth_identities.secret as email')
                                   ->join('auth_identities', 'auth_identities.user_id = users.id')
                                   ->findAll();
---
SELECT `users`.*, `auth_identities`.`secret` as `email`
FROM `users`
JOIN `auth_identities` ON `auth_identities`.`user_id` = `users`.`id`
WHERE `users`.`deleted_at` IS NULL

    public function changePassword()
    {
        $userModel = new UserModel();
        $user = $userModel->find($this->request->getPost('user_id'));
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '4'