app/Controllers/TicketController.php

    public function index()
    {
        $model = new TicketModel();

        // Fetch tickets for the logged-in user + join with category names
        $data['tickets'] = $model->select('tickets.*, categories.name as cat_name')
                                 ->join('categories', 'categories.id = tickets.category_id')
                                 ->where('user_id', auth()->id())
                                 ->orderBy('tickets.created_at', 'DESC')
                                 ->findAll();
---
SELECT `tickets`.*, `categories`.`name` as `cat_name`
FROM `tickets`
JOIN `categories` ON `categories`.`id` = `tickets`.`category_id`
WHERE `user_id` = 4
ORDER BY `tickets`.`created_at` DESC

    public function show($id)
    {
        $model = new TicketModel();
        $db = \Config\Database::connect();

        $data['ticket'] = $model->select('tickets.*, categories.name as cat_name')
                                ->join('categories', 'categories.id = tickets.category_id')
                                ->where('tickets.id', $id)
                                ->where('user_id', auth()->id())
                                ->first();

        if (!$data['ticket']) {
            return redirect()->to('/sacco/dashboard');
        }

        $data['replies'] = $db->table('replies')
                              ->select('replies.*, users.username, users.id as uid')
                              ->join('users', 'users.id = replies.user_id')
                              ->where('ticket_id', $id)
                              ->orderBy('created_at', 'ASC')
                              ->get()->getResult();
---
SELECT `tickets`.*, `categories`.`name` as `cat_name`
FROM `tickets`
JOIN `categories` ON `categories`.`id` = `tickets`.`category_id`
WHERE `tickets`.`id` = '5'
AND `user_id` = 4
 LIMIT 1
SELECT `replies`.*, `users`.`username`, `users`.`id` as `uid`
FROM `replies`
JOIN `users` ON `users`.`id` = `replies`.`user_id`
WHERE `ticket_id` = '5'
ORDER BY `created_at` ASC