app/Models/TicketModel.php

SELECT SUM(CASE WHEN status = 'Received' THEN 1 ELSE 0 END) as pending, SUM(CASE WHEN status = 'In Progress' THEN 1 ELSE 0 END) as progress, SUM(CASE WHEN status = 'Closed' THEN 1 ELSE 0 END) as closed
FROM `tickets`
WHERE `created_at` >= '2026-03-19 12:56:40'
---
    public function getWeeklyStats()
    {
        $db = \Config\Database::connect();
        $last7Days = date('Y-m-d H:i:s', strtotime('-7 days'));

        return $db->table($this->table)
                  ->select("SUM(CASE WHEN status = 'Received' THEN 1 ELSE 0 END) as pending,
                            SUM(CASE WHEN status = 'In Progress' THEN 1 ELSE 0 END) as progress,
                            SUM(CASE WHEN status = 'Closed' THEN 1 ELSE 0 END) as closed")
                  ->where('created_at >=', $last7Days)
                  ->get()->getRow();

SELECT `categories`.`name`, COUNT(tickets.id) as total
FROM `tickets`
JOIN `categories` ON `categories`.`id` = `tickets`.`category_id`
WHERE `tickets`.`created_at` >= '2026-02-01 00:00:00'
AND `tickets`.`created_at` <= '2026-02-28 23:59:59'
GROUP BY `tickets`.`category_id`
ORDER BY `total` DESC
---
    public function getCategoryRankings($startDate, $endDate)
    {
        return $this->select('categories.name, COUNT(tickets.id) as total')
                    ->join('categories', 'categories.id = tickets.category_id')
                    ->where('tickets.created_at >=', $startDate)
                    ->where('tickets.created_at <=', $endDate)
                    ->groupBy('tickets.category_id')
                    ->orderBy('total', 'DESC') // Most to Least
                    ->findAll();